import React from "react";
import img1 from "../1.png"
import a from "../a.png"
import x from "../x.png"
import { Button } from "@mui/material";
import { NavLink, useNavigate } from "react-router-dom";

const HomePage=()=>{
  const [anchorEl1, setAnchorEl1] = React.useState<null | HTMLElement>(null);
  const navigate=useNavigate();
  const handleClick1 = (event: React.MouseEvent<HTMLButtonElement>) => {
    setAnchorEl1(event.currentTarget);
  };
  const handleClose1 = () => {
    navigate('/ContactUs');
    setAnchorEl1(null);
  };
    return(
        <div>
            <img src={img1} className="imghome"></img>
            <div className="texthome"><body>
            <h1 className="h1">טרמפולינו השכרת מתנפחים לאירועים</h1>
            <p className="text">
            <br/> חברת טרמפולינו הוקמה במטרה להפיק אירועים צבעוניים, משמחים ועשירים בפעילות פיזית, תוך כדי שמירה על בטיחות וחדשנות.

חברת טרמפולינו מתחדשת לעיתים קרובות במתקנים חדשים וייחודיים על מנת ליצור פעילות חברתית, מהנה ומאתגרת אצל הילדים, כמו קפיצה וטיפוס אתגרי על מתקנים תוך שחרור אנרגיות ותנועתיות מרבית<br/>

בנוסף למתנפחים, טרמפולינו מציעה השכרת ציוד לאירועים: דוכני מזון, ציוד הגברה, תאורה דקורטיבית, בלוני הליום, מגנטים, הפעלות ושלל אטרקציות נוספות להפקת אירוע מושלם ומותאם לציפיות שלכם<br/>

הפעילות מיועדת לימי הולדת ולאירועים פרטיים מגוונים<br/>

טרמפולינו פועלת גם במרחב הציבורי והעסקי – אירועי חברה, אירועים בבתי הספר, ועדי תרבות, ימי גיבוש, ימי כיף, פסטיבלים וירידים שונים<br/>

בנוסף למתנפחים , טרמפולינו מציעה השכרת ציוד לאירועים : דוכני מזון , ציוד הגברה , תאורה דקורטיבית , בלוני הליום , מגנטים , הפעלות ושלל אטרקציות מדליקות נוספות להפקת אירוע מושלם ומותאם לציפיות שלכם<br/>

הפעילות מיועדת לימי הולדת ולאירועים פרטיים מגוונים<br/>.

טרמפולינו מותאמת ופועלת כמובן , גם במרחב הציבורי והעסקי  –  אירועי חברה, אירועים בית ספריים, ועדי תרבות , ימי גיבוש, ימי כיף, פסטיבלים וירידים שונים<br/>
</p>
</body>
 </div>
 <div className="texthome2">
  <body>
  <h3 className="h1">מתנפחים להשכרה לפי תקציב</h3>
  <h5>
  <p>
  ,הילדים שלכם גדלים בקצב מסחרר<br/>
   !אך יש יום אחד בשנה שבו אתם חוגגים את הגדילה שלהם בשנה: יום ההולדת<br/>
    ,כהורים, ששמים לעצמם למטרה להגשים את כל החלומות של הילדים<br/>
     !אתם רוצים להיות בטוחים כי אתם חוגגים להם יום הולדת מושלם
  </p>
  <p>
  ,לשמחתכם, יש נוסחה מנצחת לאירוע שכזה והיא מתחילה עם הגדרת תקציב<br/> 
  .ממשיכה עם מטעמים נפלאים ושירות של מתנפחים להשכרה<br/>
   .צרו עמנו קשר ונשמח לעזור לכם לתכנן אירוע מתנפחים מושלם לפי התקציב<br/>
    .אמנם יש שפע של מוצרים מתנפחים בשוק, אבל לא כל מתנפח מתאים לאופי האירוע שלכם<br/>
     .בעת בחירת המתנפחים חושב לבדוק את כל הפרטים של אותו מתנפח
  </p>
  </h5>
  </body>
 </div>
 <img src={x} className="img2home"></img>
 <Button onClick={handleClose1} className="navlink"><img src={a} className="1"></img></Button>
 <div className='k'></div>
     <br/><br/><br/><br/><br/><br/><br/><br/><br/><br/>
    </div> 
    )}
export default HomePage;